[
  {
    "acronym": "AAAI",
    "fullname": "Association for the Advancement of Artificial Intelligence",
    "area": "AI",
    "subarea": "Artificial Intelligence",
    "location": "Worldwide",
    "url":"https://aaai.org/",
    "description": "Founded in 1979, the Association for the Advancement of Artificial Intelligence (AAAI) (formerly the American Association for Artificial Intelligence) is a nonprofit scientific society devoted to advancing the scientific understanding of the mechanisms underlying thought and intelligent behavior and their embodiment in machines. AAAI aims to promote research in, and responsible use of, artificial intelligence. AAAI also aims to increase public understanding of artificial intelligence, improve the teaching and training of AI practitioners, and provide guidance for research planners and funders concerning the importance and potential of current AI developments and future directions."
  },
  {
    "acronym": "IJCAI",
    "fullname": "International Joint Conference on Artificial Intelligence",
    "area": "AI",
    "subarea": "Artificial Intelligence",
    "location": "Worldwide",
    "url":"https://www.ijcai.org/",
    "description":"International Joint Conferences on Artificial Intelligence is a non-profit corporation founded in California, in 1969 for scientific and educational purposes, including dissemination of information on Artificial Intelligence at conferences in which cutting-edge scientific results are presented and through dissemination of materials presented at these meetings in form of Proceedings, books, video recordings, and other educational materials. IJCAI consists of two divisions: the Conference Division and the AI Journal Division. IJCAI conferences present premier international gatherings of AI researchers and practitioners and they were held biennially in odd-numbered years since 1969."

  },
  {
    "acronym": "CVPR",
    "fullname": "Computer Vision and Pattern Recognition",
    "area": "AI",
    "subarea": "Computer Vision",
    "location": "Worldwide",
    "url":"http://thecvf.com/",
    "description":"CVPR is the premier annual computer vision event comprising the main conference and several co-located workshops and short courses. With its high quality and low cost, it provides an exceptional value for students, academics and industry researchers."
  },
  {
    "acronym": "ECCV",
    "fullname": "European Conference on Computer Vision",
    "area": "AI",
    "subarea": "Computer Vision",
    "location": "Europe",
    "url":"https://www.eccv.org",
    "description":"ECCV, the European Conference on Computer Vision, is a biennial research conference with the proceedings published by Springer Science+Business Media. Similar to ICCV in scope and quality, it is held those years which ICCV is not. "
  },
  {
    "acronym": "ICCV",
    "fullname": "IEEE International Conference on Computer Vision",
    "area": "AI",
    "subarea": "Computer Vision",
    "location": "Worldwide",
    "url":"http://iccv2021.thecvf.com/",
    "description":"ICCV is the premier international computer vision event comprising the main conference and several co-located workshops and tutorials. With its high quality and low cost, it provides an exceptional value for students, academics and industry researchers."
  },
  {
    "acronym": "ICML",
    "fullname": "International Conference on Machine Learning",
    "area": "AI",
    "subarea": "Machine learning and data mining",
    "location": "Worldwide",
    "url":"https://icml.cc/",
    "description":"The International Conference on Machine Learning (ICML) is the premier gathering of professionals dedicated to the advancement of the branch of artificial intelligence known as machine learning. ICML is globally renowned for presenting and publishing cutting-edge research on all aspects of machine learning used in closely related areas like artificial intelligence, statistics and data science, as well as important application areas such as machine vision, computational biology, speech recognition, and robotics. ICML is one of the fastest growing artificial intelligence conferences in the world. Participants at ICML span a wide range of backgrounds, from academic and industrial researchers, to entrepreneurs and engineers, to graduate students and postdocs."
  },
  {
    "acronym": "KDD",
    "fullname": "Knowledge Discovery and Data Mining",
    "area": "AI",
    "subarea": "Machine learning and data mining",
    "location": "Worldwide",
    "url":"https://www.kdd.org/about",
    "description":"SIGKDD's mission to provide the premier forum for advancement, education, and adoption of the science of knowledge discovery and data mining from all types of data stored in computers and networks of computers."
  },
  {
    "acronym": "NIPS",
    "fullname": "Neural Information Processing Systems",
    "area": "AI",
    "subarea": "Machine learning and data mining",
    "location": "Worldwide",
    "url":"https://nips.cc/",
    "description":"The Neural Information Processing Systems Foundation is a non-profit corporation whose purpose is to foster the exchange of research on neural information processing systems in their biological, technological, mathematical, and theoretical aspects. Neural information processing is a field which benefits from a combined view of biological, physical, mathematical, and computational sciences. The primary focus of the Foundation is the presentation of a continuing series of professional meetings known as the Neural Information Processing Systems Conference, held over the years at various locations in the United States, Canada and Spain."
  },
  {
    "acronym": "ACL",
    "fullname": "Annual Meeting of the Association for Computational Linguistics",
    "area": "AI",
    "subarea": "Natural language processing",
    "location": "Worldwide",
    "url":"https://saclweb.org",
    "description":"The Association for Computational Linguistics is the international scientific and professional society for people working on problems involving natural language and computation. An annual meeting is held each summer in locations where significant computational linguistics research is carried out."
  },
  {
    "acronym": "EMNLP",
    "fullname": "Conference on Empirical Methods in Natural Language Processing",
    "area": "AI",
    "subarea": "Natural language processing",
    "location": "Worldwide",
    "url":"https://emnlp.org/",
    "description":"The 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP 2020) invites the submission of long and short papers on substantial, original, and unpublished research in empirical methods for Natural Language Processing. As in recent years, some of the presentations at the conference will be for papers accepted by the Transactions of the ACL (TACL) and Computational Linguistics (CL) journals."
  },
  {
    "acronym": "NAACL",
    "fullname": "North American Chapter of the Association for Computational Linguistics",
    "area": "AI",
    "subarea": "Natural language processing",
    "location": "North-America",
    "url":"naacl.org",
    "description":"The North American Chapter of the Association for Computational Linguistics provides a regional focus for members of the Association for Computational Linguistics in North America as well as in Central and South America, organizes annual conferences, promotes cooperation and information exchange among related scientific and professional societies, encourages and facilitates ACL membership by people and institutions in the Americas, and provides a source of information on regional activities for the ACL Executive Committee."
  },
  {
    "acronym": "SIGIR",
    "fullname": "Annual International ACM SIGIR Conference on Research and Development in Information Retrieval",
    "area": "AI",
    "subarea": "The Web & information retrieval",
    "location": "Worldwide",
    "url":"https://sigir.org/",
    "description":"SIGIR is the Association for Computing Machinery’s Special Interest Group on Information Retrieval. Since 1963, we have promoted research, development and education in the area of search and other information access technologies."
  },
  {
    "acronym": "WWW",
    "fullname": "International World Wide Web Conferences",
    "area": "AI",
    "subarea": "The Web & information retrieval",
    "location": "Worldwide",
    "url":"https://thewebconf.org",
    "description":"The Web Conference is a yearly international academic conference on the topic of the future direction of the World Wide Web. The conference was first created by Tim Berners-Lee in 1989 at CERN in Geneva, Switzerland"
  },
  {
    "acronym": "ASPLOS",
    "fullname": "International Conference on Architectural Support for Programming Languages and Operating Systems",
    "area": "Systems",
    "subarea": "Computer architecture",
    "location": "Worldwide",
    "url":"https://asplos-conference.org/",
    "description":"ASPLOS is the premier forum for interdisciplinary systems research, intersecting computer architecture, hardware and emerging technologies, programming languages and compilers, operating systems, and networking. "
  },
  {
    "acronym": "ISCA",
    "fullname": "International Symposium on Computer Architecture",
    "area": "Systems",
    "subarea": "Computer architecture",
    "location": "Worldwide",
    "url":"https://www.iscaconf.org/",
    "description":"The International Symposium on Computer Architecture (ISCA) is the premier forum for new ideas and research results in computer architecture. In 2020, the 47th edition of ISCA will be held worldwide in a virtual format."
  },
  {
    "acronym": "MICRO",
    "fullname": "Annual IEEE/ACM International Symposium on Microarchitecture",
    "area": "Systems",
    "subarea": "Computer architecture",
    "location": "Worldwide",
    "url":"https://www.microarch.org/",
    "description":"The IEEE/ACM International Symposium on Microarchitecture® is the premier forum for presenting, discussing, and debating innovative microarchitecture ideas and techniques for advanced computing and communication systems. This symposium brings together researchers in fields related to microarchitecture, compilers, chips, and systems for technical exchange on traditional microarchitecture topics and emerging research areas. The MICRO community has enjoyed a close interaction between academic researchers and industrial designers."
  },
  {
    "acronym": "HPCA",
    "fullname": "International Symposium on High-Performance Computer Architecture",
    "area": "Systems",
    "subarea": "Computer architecture",
    "location": "Worldwide",
    "url":"https://www.hpca-conf.org/",
    "description":"The 26th International Symposium on High-Performance Computer Architecture provides a high-quality forum for scientists and engineers to present their latest research findings in this rapidly-changing field."
  },
  {
    "acronym": "SIGCOMM",
    "fullname": "Conference on Applications, Technologies, Architectures, and Protocols for Computer Communication",
    "area": "Systems",
    "subarea": "Computer networks",
    "location": "Worldwide",
    "url":"https://sigcomm.org",
    "description":"SIGCOMM is the Association for Computing Machinery's Special Interest Group on Data Communications, which specializes in the field of communication and computer networks. It is also the name of an annual 'flagship' conference, organized by SIGCOMM, which is considered to be the leading conference in data communications and networking in the world. Known to have an extremely low acceptance rate, many of the landmark works in Networking and Communications have been published through it."
  },
  {
    "acronym": "NSDI",
    "fullname": "Symposium on Networked Systems Design and Implementation",
    "area": "Systems",
    "subarea": "Computer networks",
    "location": "Worldwide",
    "url":"https://www.usenix.org/conference/",
    "description":"NSDI focuses on the design principles, implementation, and practical evaluation of networked and distributed systems. Our goal is to bring together researchers from across the networking and systems community to foster a broad approach to addressing overlapping research challenges."
  },
  {
    "acronym": "CCS",
    "fullname": "Conference on Computer and Communications Security",
    "area": "Systems",
    "subarea": "Computer Security",
    "location": "Worldwide",
    "url":"https://www.sigsac.org/ccs",
    "description":"The ACM Conference on Computer and Communications Security (CCS) is the flagship annual conference of the Special Interest Group on Security, Audit and Control (SIGSAC) of the Association for Computing Machinery (ACM). The conference brings together information security researchers, practitioners, developers, and users from all over the world to explore cutting-edge ideas and results. It provides an environment to conduct intellectual discussions. From its inception, CCS has established itself as a high standard research conference in its area."
  },
  {
    "acronym": "Security-Privacy",
    "fullname": "IEEE Symposium on Security and Privacy",
    "area": "Systems",
    "subarea": "Computer Security",
    "location": "Worldwide",
    "url":"https://www.ieee-security.org/TC/",
    "description": "Since 1980, the IEEE Symposium on Security and Privacy has been the premier forum for presenting developments in computer security and electronic privacy, and for bringing together researchers and practitioners in the field. "
  },
  {
    "acronym": "USENIX",
    "fullname": "USENIX Security Symposium",
    "area": "Systems",
    "subarea": "Computer Security",
    "location": "Worldwide",
    "url":"https://www.usenix.org/",
    "description":"The USENIX Association is a 501(c)(3) nonprofit organization, dedicated to supporting the advanced computing systems communities and furthering the reach of innovative research. We are known for organizing conferences and publishing research, but our greatest strength lies in building communities in computing systems. We represent the interests of our communities in a variety of ways, including our professional affiliation with the Computing Research Association."
  },
  {
    "acronym": "NDSS",
    "fullname": "Network and Distributed System Security Symposium",
    "area": "Systems",
    "subarea": "Computer Security",
    "location": "Worldwide",
    "url":"https://www.ndss-symposium.org/",
    "description":"The Network and Distributed System Security Symposium (NDSS) fosters information exchange among researchers and practitioners of network and distributed system security. The target audience includes those interested in practical aspects of network and distributed system security, with a focus on actual system design and implementation. A major goal is to encourage and enable the Internet community to apply, deploy, and advance the state of available security technologies."
  },

  {
    "acronym": "SIGMOD",
    "fullname": "International Conference on Management of Data",
    "area": "Systems",
    "subarea": "Databases",
    "location": "Worldwide",
    "url":"https://sigmod.org",
    "description":"SIGMOD is the Association for Computing Machinery's Special Interest Group on Management of Data, which specializes in large-scale data management problems and databases."
  },
  {
    "acronym": "VLDB",
    "fullname": "Very Large Data Bases Conference",
    "area": "Systems",
    "subarea": "Databases",
    "location": "Worldwide",
    "url":"https://svldb.org",
    "description":"VLDB is a premier annual international forum for data management and database researchers, vendors, practitioners, application developers, and users."
  },
  {
    "acronym": "ICDE",
    "fullname": "IEEE International Conference on Data Engineering",
    "area": "Systems",
    "subarea": "Databases",
    "location": "Oslo, Norway",
    "url":"https://icde.org",
    "description":"The International Council for Open and Distance Education is a membership-led global organization in the field of online, open, flexible and technology enhanced education. It consists of more than 200 higher education institutions and organizations in some 84 countries."
  },
  {
    "acronym": "PODS",
    "fullname": "ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems",
    "area": "Systems",
    "subarea": "Databases",
    "location": "Worldwide",
    "url":"http://sigmod2019.org/",
    "description":"The annual ACM SIGMOD/PODS Conference is a leading international forum for database researchers, practitioners, developers, and users to explore cutting-edge ideas and results, and to exchange techniques, tools, and experiences. The conference includes a fascinating technical program with research and industrial talks, tutorials, demos, and focused workshops. It also hosts a poster session to learn about innovative technology, an industrial exhibition to meet companies and publishers, and a careers-in-industry panel with representatives from leading companies."
  },
  {
    "acronym": "DAC",
    "fullname": "Design Automation Conference",
    "area": "Systems",
    "subarea": "Design automation",
    "location": "Worldwide",
    "url":"https://dac.com/",
    "description":"The Design Automation Conference (DAC) is recognized as the premier conference for design and automation of electronic systems.  DAC offers outstanding training, education, exhibits and superb networking opportunities for designers, researchers, tool developers and vendors."
  },
  {
    "acronym": "ICCAD",
    "fullname": "International Conference on Computer Aided Design",
    "area": "Systems",
    "subarea": "Design automation",
    "location": "Worldwide",
    "url":"https://www.iccad.com/",
    "description":"SIGDA is committed to advancing the skills and knowledge of electronic design automation professionals and students throughout the world. We do so in a variety of ways: sponsoring and organizing international workshops, symposia and conferences; leading the way in capturing archival electronic design automation publications on CD-ROM; providing travel grants to sponsored workshops, symposia and conferences; pioneering the maintenance and distribution of electronic design automation benchmarks; hosting university and government researchers for software demonstrations at the University Booth at DAC and ICCAD; publishing the SIGDA Newsletter; maintaining a World Wide Web access site on Internet; and by initiating the new ACM Transactions on Design Automation of Electronic Systems."
  },
  {
    "acronym": "EMSOFT",
    "fullname": "International Conference on Embedded Software",
    "area": "Systems",
    "subarea": "Embedded and real-time systems",
    "location": "Worldwide",
    "url":"https://www.esweek.org/",
    "description":"The ACM SIGBED International Conference on Embedded Software (EMSOFT) brings together researchers and developers from academia, industry, and government to advance the science, engineering, and technology of embedded software development. Since 2001, EMSOFT has been the premier venue for cutting-edge research in the design and analysis of software that interacts with physical processes, with a long-standing tradition for results on cyber-physical systems, which compose computation, networking, and physical dynamics."
  },
  {
    "acronym": "RTAS",
    "fullname": "IEEE Real Time Technology and Applications Symposium",
    "area": "Systems",
    "subarea": "Embedded and real-time systems",
    "location": "Worldwide",
    "url":"https://rtas.org/",
    "description":" RTAS is a top-tier conference with a focus on systems research related to embedded systems and time-sensitive systems (of any size). The broad scope of RTAS’20 ranges from traditional hard real-time systems to embedded systems without explicit timing requirements, including latency-sensitive systems with informal or soft real-time requirements."
  },
  {
    "acronym": "RTSS",
    "fullname": "IEEE Real-Time Systems Symposium",
    "area": "Systems",
    "subarea": "Embedded and real-time systems",
    "location": "Worldwide",
    "url":"https://rtss.org/",
    "description":"The IEEE Real-Time Systems Symposium (RTSS) is the premier conference in the field of real-time systems, and is a venue for researchers and practitioners to showcase innovations covering all aspects of real-time systems, including theory, design, analysis, implementation, evaluation, and experience. RTSS ’20, celebrating the 41st anniversary of the event, continues the trend of making RTSS an expansive and inclusive event, striving to embrace new and emerging areas of real-time systems research."
  },
  {
    "acronym": "HPDC",
    "fullname": "IEEE International Symposium on High Performance Distributed Computing",
    "area": "Systems",
    "subarea": "High-performance computing",
    "location": "Worldwide",
    "url":"http://www.hpdc.org/",
    "description":"HPDC is the premier computer science conference for presenting new research relating to high performance parallel and distributed systems used in both science and industry. For twenty years, HPDC has been at the center of new discoveries in systems such as clusters, grids, clouds, and parallel and multicore computers. "
  },
  {
    "acronym": "ICS",
    "fullname": "International Conference on Supercomputing ",
    "area": "Systems",
    "subarea": "High-performance computing",
    "location": "Worldwide",
    "url":"https://www.ics-conference.org/",
    "description":"ICS is the premier international forum for the presentation of research results in high-performance computing systems held since 1987. The focus of ICS is the high performance computers and computation:Architecture including power-aware, parallel I/O, grid-based, web-based, continuous monitoring, self-healing, fault-tolerant, embedded Productivity including benchmarks, performance evaluation studies, specialized languages, program development tools Systems including compilers, operating systems, schedulers, runtime optimization Applications including numeric and non-numeric, scientific, biological, industrial, massive sensory processing Theoretical underpinnings of any of the above topics as well as analysis and experimental evaluation of systems."
  },
  {
    "acronym": "SC",
    "fullname": "International Conference for High Performance Computing, Networking, Storage and Analysis",
    "area": "Systems",
    "subarea": "High-performance computing",
    "location": "Worldwide",
    "url":"https://supercomputing.org/",
    "description":"HPC is the underpinning for many of today’s most exciting new research areas, from machine learning to artificial intelligence to quantum computing. Working with science teams across disciplines, we are finding new ways to fight disease, combat poverty and homelessness, grow heartier crops, and better predict natural disasters. Bring your passion and energy for HPC to SC20 in Atlanta, where together, we can be more than HPC."
  },
  {
    "acronym": "MOBICOM",
    "fullname": "ACM/IEEE International Conference on Mobile Computing and Networking",
    "area": "Systems",
    "subarea": "Mobile computing",
    "location": "Worldwide",
    "url":"https://sigmobile.org/mobicom/",
    "description":"The Annual International Conference on Mobile Computing and Networking (MobiCom) has been held every year since 1995. The conference serves as the premier international forum addressing networks, systems, algorithms, and applications that support the symbiosis of mobile computers and wireless networks. The conference covers all areas of mobile computing and mobile and wireless networking."
  },
  {
    "acronym": "MOBISYS",
    "fullname": "ACM SIGMOBILE International Conference on Mobile Systems, Applications, and Services",
    "area": "Systems",
    "subarea": "Mobile computing",
    "location": "Worldwide",
    "url":"https://sigmobile.org/mobisys/",
    "description":"MobiSys seeks to present innovative and significant research on the design, implementation, usage, and evaluation of mobile computing and wireless systems, applications, and services. "
  },
  {
    "acronym": "SENSYS",
    "fullname": "ACM International Conference on Embedded Networked Sensor Systems",
    "area": "Systems",
    "subarea": "Mobile computing",
    "location": "Worldwide",
    "url":"https://sensys.acm.org/",
    "description":"SenSys introduces a highly selective, single-track forum for research on systems issues of networked sensing and actuation, broadly defined. Systems of smart sensors and actuators will revolutionize a wide array of application areas by providing an unprecedented density and fidelity of instrumentation. They also present systems challenges because of resource constraints, uncertainty, irregularity, mobility, and scale. This conference provides an ideal venue to address research challenges facing the design, development, deployment, use, and fundamental limits of these systems. Sensing and actuation systems require contributions from many fields, from wireless communication and networking, embedded systems and hardware, energy harvesting and management, distributed systems and algorithms, data management, and applications, so we welcome cross-disciplinary work."
  },

  {
    "acronym": "IMC",
    "fullname": "ACM/SIGCOMM Internet Measurement Conference",
    "area": "Systems",
    "subarea": "Measurement and performance analysis",
    "location": "Worldwide",
    "url":"https://conferences.sigcomm.org/imc/",
    "description":"IMC takes a broad view of contributions that are considered in scope for improving the practice of network measurement, including, but not limited to: collection and analysis of data that yield new insights about network structure and network performance (e.g., traffic, topology, routing, energy utilization) collection and analysis of data that yield new insights about application and end-user behavior (e.g., economics, privacy, security, application interaction with protocols)measurement-based modeling of network internals and application behavior (e.g., workloads, scaling behavior, assessment of performance bottlenecks) methods and tools to monitor and visualize network-based phenomena systems and algorithms that build on measurement-based findings advances in data collection, analysis, and storage (e.g., anonymization, querying, sharing) reappraisal of previous empirical network measurements and measurement-based conclusions descriptions of challenges and future directions the measurement community should pursue"
  },
  {
    "acronym": "SIGMETRICS",
    "fullname": "Measurement and Modeling of Computer Systems",
    "area": "Systems",
    "subarea": "Measurement and performance analysis",
    "location": "Worldwide",
    "url":"https://www.sigmetrics.org",
    "description":"SIGMETRICS is the Association for Computing Machinery's Special Interest Group on Measurement and Evaluation, which specializes in the field of performance analysis, measurement, and modeling of computer systems."
  },
  {
    "acronym": "OSDI",
    "fullname": "USENIX Symposium on Operating Systems Design and Implementation",
    "area": "Systems",
    "subarea": "Operating systems",
    "location": "Worldwide",
    "url":"https://www.usenix.org/conference/osdi",
    "description":"The symposium emphasizes innovative research as well as quantified or insightful experiences in systems design and implementation."
  },
  {
    "acronym": "SOSP",
    "fullname": "Symposium on Operating Systems Principles",
    "area": "Systems",
    "subarea": "Operating systems",
    "location": "Worldwide",
    "url":"http://sosp.org/",
    "description":"The Symposium on Operating Systems Principles, organized by the Association for Computing Machinery, is one of the most prestigious single-track academic conferences on operating systems. SOSP is held every other year, alternating with the conference on Operating Systems Design and Implementation. The first SOSP was held in 1967. It is sponsored by the ACM's Special Interest Group on Operating Systems."
  },
  {
    "acronym": "EUROSYS",
    "fullname": "European Conference on Computer Systems",
    "area": "Systems",
    "subarea": "Operating systems",
    "location": "Europe",
    "url":"https://www.eurosys2020.org/",
    "description":"The EuroSys conference series brings together professionals from academia and industry. It has a strong focus on systems research and development: operating systems, database systems, real-time systems, network middleware, distributed, parallel, or embedded computing systems. EuroSys has become a premier forum for discussing various issues of systems software research and development, including implications related to hardware and applications.    "
  },
  {
    "acronym": "FAST",
    "fullname": "USENIX Conference on File and Storage Technologies",
    "area": "Systems",
    "subarea": "Operating systems",
    "location": "Worldwide",
    "url":"https://www.usenix.org/conference/fast",
    "description":"FAST brings together storage-system researchers and practitioners to explore new directions in the design, implementation, evaluation, and deployment of storage systems."
  },
  {
    "acronym": "USENIX ATC",
    "fullname": "USENIX Annual Technical Conference",
    "area": "Systems",
    "subarea": "Operating systems",
    "location": "Worldwide",
    "url":"https://www.usenix.org/conference/atc",
    "description":"USENIX ATC brings together leading systems researchers for the presentation of cutting-edge systems research and the opportunity to gain insight into a wealth of must-know topics, including virtualization, system and network management and troubleshooting, cloud and edge computing, security, privacy, and trust, mobile and wireless, and more."
  },
  {
    "acronym": "PLDI",
    "fullname": "ACM-SIGPLAN Symposium on Programming Language Design and Implementation",
    "area": "Systems",
    "subarea": "Programming languages",
    "location": "Worldwide",
    "url":"https://sigplan.org/",
    "description":"Programming Language Design and Implementation is one of the ACM SIGPLAN's most important conferences. The precursor of PLDI was the Symposium on Compiler Optimization, held July 27–28, 1970 at the University of Illinois at Urbana-Champaign and chaired by Robert S. Northcote"
  },
  {
    "acronym": "POPL",
    "fullname": "ACM-SIGACT Symposium on Principles of Programming Languages",
    "area": "Systems",
    "subarea": "Programming languages",
    "location": "Worldwide",
    "url":"https://sigplan.org/Conferences/POPL/",
    "description":"The annual ACM SIGPLAN-SIGACT Symposium on Principles of Programming Languages is an academic conference in the field of computer science, with focus on fundamental principles in the design, definition, analysis, and implementation of programming languages, programming systems, and programming interfaces."
  },
  {
    "acronym": "ICFP",
    "fullname": "ACM SIGPLAN International Conference on Functional Programming",
    "area": "Systems",
    "subarea": "Programming languages",
    "location": "Worldwide",
    "url":"https://www.icfp.co.za",
    "description":"The ACM SIGPLAN International Conference on Functional Programming is an annual academic conference in the field of computer science sponsored by the ACM SIGPLAN, in association with IFIP Working Group 2.8. The conference focuses on functional programming and related areas of programming languages, logic, compilers and software development.    "
  },
  {
    "acronym": "OOPSLA",
    "fullname": "ACM SIGPLAN International Conference on Systems, Programming, Languages and Applications: Software for Humanity",
    "area": "Systems",
    "subarea": "Programming languages",
    "location": "Worldwide",
    "url":"https://2020.splashcon.org/track/splash-2020-oopsla",
    "description":"OOPSLA is an annual ACM research conference. OOPSLA mainly takes place in the United States, while the sister conference of OOPSLA, ECOOP, is typically held in Europe. It is operated by the Special Interest Group for Programming Languages group of the Association for Computing Machinery"
  },
  {
    "acronym": "FSE",
    "fullname": "ACM SIGSOFT Conference on the Foundations of Software Engineering",
    "area": "Systems",
    "subarea": "Software engineering",
    "location": "Worldwide",
    "url":"https://2021.esec-fse.org/",
    "description":"The ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE) is an internationally renowned forum for researchers, practitioners, and educators to present and discuss the most recent innovations, trends, experiences, and challenges in the field of software engineering. ESEC/FSE brings together experts from academia and industry to exchange the latest research results and trends as well as their practical application in all areas of software engineering."
  },
  {
    "acronym": "ICSE",
    "fullname": "International Conference on Software Engineering",
    "area": "Systems",
    "subarea": "Software engineering",
    "location": "Worldwide",
    "url":"http://www.icse-conferences.org/",
    "description":"ICSE, the International Conference on Software Engineering,® is the premier software engineering conference, providing a forum for researchers, practitioners and educators to present and discuss the most recent innovations, trends, experiences and concerns in the field of software engineering."
  },
  {
    "acronym": "ASE",
    "fullname": "International Conference on Automated Software Engineering ",
    "area": "Systems",
    "subarea": "Software engineering",
    "location": "Worldwide",
    "url":"https://ase-conferences.org/",
    "description":"The conference is the premier research forum for automated software engineering. Each year, it brings together researchers and practitioners from academia and industry to discuss foundations, techniques, and tools for automating the analysis, design, implementation, testing, and maintenance of large software systems."
  },
  {
    "acronym": "ISSTA",
    "fullname": "International Symposium on Software Testing and Analysis",
    "area": "Systems",
    "subarea": "Software engineering",
    "location": "Worldwide",
    "url":"https://conf.researchr.org/home/issta",
    "description":"The ACM SIGSOFT International Symposium on Software Testing and Analysis is the leading research symposium on software testing and analysis, bringing together academics, industrial researchers, and practitioners to exchange new ideas, problems, and experience on how to analyze and test software systems."
  },
  {
    "acronym": "FOCS",
    "fullname": "IEEE Annual Symposium on Foundations of Computer Science",
    "area": "Theory",
    "subarea": "Algorithms and complexity",
    "location": "Worldwide",
    "url":"https://ieee-focs.org",
    "description":"The IEEE Symposium on Foundations of Computer Science (FOCS) is the flagship conference sponsored by the IEEE Computer Society Technical Committee on the Mathematical Foundations of Computing (TCMF) and covers a broad range of theoretical computer science."
  },
  {
    "acronym": "SODA",
    "fullname": "Symposium on Discrete Algorithms",
    "area": "Theory",
    "subarea": "Algorithms and complexity",
    "location": "Worldwide",
    "url":"https://www.siam.org/conferences/cm/conference/soda",
    "description":"This symposium focuses on research topics related to efficient algorithms and data structures for discrete problems. In addition to the design of such methods and structures, the scope also includes their use, performance analysis, and the mathematical problems related to their development or limitations. Performance analyses may be analytical or experimental and may address worst-case or expected-case performance. Studies can be theoretical or based on data sets that have arisen in practice and may address methodological issues involved in performance analysis."
  },
  {
    "acronym": "STOC",
    "fullname": "ACM-SIAM Symposium on the Theory of Computing",
    "area": "Theory",
    "subarea": "Algorithms and complexity",
    "location": "Worldwide",
    "url":"https://dl.acm.org/conference/stoc/",
    "description":"The Annual ACM Symposium on Theory of Computing is an academic conference in the field of theoretical computer science. STOC has been organized annually since 1969, typically in May or June; the conference is sponsored by the Association for Computing Machinery special interest group SIGACT"
  },
  {
    "acronym": "CRYPTO",
    "fullname": "Annual International Cryptology Conference",
    "area": "Theory",
    "subarea": "Cryptography",
    "location": "Worldwide",
    "url":"https://crypto.iacr.org/",
    "description":"CRYPTO, the International Cryptology Conference, is an academic conference in cryptography and cryptanalysis. It is organized by the International Association for Cryptologic Research, and it is held yearly in August in Santa Barbara, California at the University of California, Santa Barbara"
  },
  {
    "acronym": "EUROCRYPT",
    "fullname": "International Conference on the Theory and Application of Cryptographic Techniques",
    "area": "Theory",
    "subarea": "Cryptography",
    "location": "Europe",
    "url":"https://www.iacr.org/meetings/eurocrypt/",
    "description": "The IACR is a non-profit organization devoted to supporting the promotion of the science of cryptology. Cryptology is the science of the making and breaking of encryption algorithms, but in the modern world it encompasses so much more. You use cryptology all the time, when banking, when using a mobile phone, when opening your car door. "
  },
  {
    "acronym": "CAV",
    "fullname": "International Conference on Computer Aided Verification",
    "area": "Theory",
    "subarea": "Logic and verification",
    "location": "Worldwide",
    "url":"http://i-cav.org/",
    "description":"The conference covers the spectrum from theoretical results to concrete applications, with an emphasis on practical verification tools and the algorithms and techniques that are needed for their implementation. CAV considers it vital to continue spurring advances in hardware and software verification while expanding to new domains such as biological systems and computer security."
  },
  {
    "acronym": "LICS",
    "fullname": "Logic in Computer Science",
    "area": "Theory",
    "subarea": "Logic and verification",
    "location": "Worldwide",
    "url":"https://www.loma.org/Events/Conferences/2020/LIC_Meetings/LIC_Annual_Meeting_and_Marketing_Conference.aspx",
    "description":"The LICS Symposium is an annual international forum on theoretical and practical topics in computer science that relate to logic, broadly construed. We invite submissions on topics that fit under that rubric. Suggested, but not exclusive, topics of interest include: automata theory, automated deduction, categorical models and logics, concurrency and distributed computation, constraint programming, constructive mathematics, database theory, decision procedures, description logics, domain theory, finite model theory, formal aspects of program analysis, formal methods, foundations of computability, games and logic, higher-order logic, lambda and combinatory calculi, linear logic, logic in artificial intelligence, logic programming, logical aspects of bioinformatics, logical aspects of computational complexity, logical aspects of quantum computation, logical frameworks, logics of programs, modal and temporal logics, model checking, probabilistic systems, process calculi, programming language semantics, proof theory, real-time systems, reasoning about security and privacy, rewriting, type systems and type theory, and verification."
  },
  {
    "acronym": "ISMB",
    "fullname": "Intelligent Systems in Molecular Biology",
    "area": "Interdisciplinary Areas",
    "subarea": "Comp. bio & bioinformatics",
    "location": "Worldwide",
    "url":"https://www.iscb.org/",
    "description":"Society membership reflects commitment toward the advancement of computational biology. The ISCB is an international non-profit organization whose members come from the global bioinformatics and computational biology communities. The ISCB serves its global membership by providing high-quality meetings, publications, and reports on methods and tools; by disseminating key information about bioinformatics resources and relevant news from related fields; and by actively facilitating training, education, employment, career development, and networking. We advocate and provide leadership for resources and policies in support of scientific endeavors and to benefit society at large."
  },
  {
    "acronym": "RECOMB",
    "fullname": "Annual International Conference on Research in Computational Molecular Biology",
    "area": "Interdisciplinary Areas",
    "subarea": "Comp. bio & bioinformatics",
    "location": "Worldwide",
    "url":"https://recomb2019.org/",
    "description":"Research in Computational Molecular Biology is an annual academic conference on the subjects of bioinformatics and computational biology. The conference has been held every year since 1997 and is a major international conference in computational biology, alongside the ISMB and ECCB conferences."
  },
  {
    "acronym": "SIGGRAPH",
    "fullname": "International Conference on Computer Graphics and Interactive Techniques",
    "area": "Interdisciplinary Areas",
    "subarea": "Computer graphics",
    "location": "Worldwide",
    "url":"https://www.siggraph.org/",
    "description": "ACM SIGGRAPH is a thriving international organization. Everybody who shares ACM SIGGRAPH's love for computer graphics and interactive techniques is warmly invited to join ACM SIGGRAPH and attend SIGGRAPH or SIGGRAPH Asia."
  },
  {
    "acronym": "SIGGRAPH Asia",
    "fullname": "International Conference on Computer Graphics and Interactive Techniques",
    "area": "Interdisciplinary Areas",
    "subarea": "Computer graphics",
    "location": "Asia",
    "url":"https://www.siggraph.org/",
    "description": "ACM SIGGRAPH is a thriving international organization. Everybody who shares ACM SIGGRAPH's love for computer graphics and interactive techniques is warmly invited to join ACM SIGGRAPH and attend SIGGRAPH or SIGGRAPH Asia."
  },
  {
    "acronym": "EC",
    "fullname": "ACM Conference on Economics and Computation",
    "area": "Interdisciplinary Areas",
    "subarea": "Economics & computation",
    "location": "Worldwide",
    "url":"https://dl.acm.org/conference/ec",
    "description": "Since 1999, the ACM Special Interest Group on Electronic Commerce (SIGECOM) outlink has sponsored the leading scientific conference on advances in theory, systems, and applications for electronic commerce. The EC symposium features invited speakers, paper presentations, workshops, and tutorials covering all areas of electronic commerce. The natural focus of the conference is on computer science issues, but the conference is interdisciplinary in nature."
  },
  {
    "acronym": "WINE",
    "fullname": "Workshop on Internet and Network Economics",
    "area": "Interdisciplinary Areas",
    "subarea": "Economics & computation",
    "location": "Worldwide",
    "url":"",
    "description":"Not found"
  },
  {
    "acronym": "CHI",
    "fullname": "International Conference on Human Factors in Computing Systems",
    "area": "Interdisciplinary Areas",
    "subarea": "Human-computer interaction",
    "location": "Worldwide",
    "url":"https://chi2020.acm.org",
    "description":"The ACM Conference on Human Factors in Computing Systems series of academic conferences is generally considered the most prestigious in the field of human–computer interaction and is one of the top-ranked conferences in computer science. It is hosted by ACM SIGCHI, the Special Interest Group on computer–human interaction."
  },
  {
    "acronym": "UbiCOMP",
    "fullname": "Ubiquitous Computing",
    "area": "Interdisciplinary Areas",
    "subarea": "Human-computer interaction",
    "location": "Worldwide",
    "url":"http://ubicomp.org/ubicomp2020/",
    "description":"UbiComp is a premier interdisciplinary venue in which leading international researchers, designers, developers, and practitioners in the field present and discuss novel results in all aspects of ubiquitous and pervasive computing. This includes the design, development, and deployment of ubiquitous and pervasive computing technologies and the understanding of human experiences and social impacts that these technologies facilitate."  
    },
  {
    "acronym": "Pervasive",
    "fullname": "International Conference on Pervasive Computing",
    "area": "Interdisciplinary Areas",
    "subarea": "Human-computer interaction",
    "location": "Worldwide",
    "url":"",
    "description":"Not found"
    },
  {
    "acronym": "IMWUT",
    "fullname": "Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies",
    "area": "Interdisciplinary Areas",
    "subarea": "Human-computer interaction",
    "location": "Worldwide",
    "url":"https://dl.acm.org/journal/imwut",
    "description":"The Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies (IMWUT) is a premier journal series for research relevant to the post-PC era. Computing technology is becoming increasingly pervasive; embedded throughout the environment as well as in mobile devices, wearables, and the Internet of Things. This is leading to a transformative change in the utility that technology can provide to users and societies, and how people relate to technology. IMWUT covers a broad range of topics relevant to this change, such as mobile systems, wearable technologies and intelligent environments. The scope includes research contributions in systems and infrastructures, new hardware and sensing techniques, and studies of user experiences and societal impact. IMWUT also welcomes contributions on new methodologies and tools, theories and models, as well as visionary and survey papers that help advance the field."  
  },
  {
    "acronym": "UIST",
    "fullname": "ACM Symposium on User Interface Software and Technology",
    "area": "Interdisciplinary Areas",
    "subarea": "Human-computer interaction",
    "location": "Worldwide",
    "url":"https://uist.acm.org/uist2020/",
    "description":"The ACM Symposium on User Interface Software and Technology (UIST) is the premier forum for innovations in human-computer interfaces. Sponsored by ACM special interest groups on computer-human interaction (SIGCHI) and computer graphics (SIGGRAPH), UIST brings together people from diverse areas including graphical & web user interfaces, tangible & ubiquitous computing, virtual & augmented reality, multimedia, new input & output devices, and CSCW. The intimate size and intensive program make UIST an ideal opportunity to exchange research results and ideas."  
  },
  {
    "acronym": "ICRA",
    "fullname": "IEEE International Conference on Robotics and Automation",
    "area": "Interdisciplinary Areas",
    "subarea": "Robotics",
    "location": "Worldwide",
    "url":"https://icra2020.org/",
    "description":"ICRA 2020 has been re-envisioned as a virtual conference, for the safety of our community and to grant an inclusive experience for a period of three months. We are pleased to announce that IEEE Robotics and Automation Society is offering ICRA attendance at very affordable rates to all attendees. Our goal is bringing cutting-edge ICRA sessions to our community around the globe and provide opportunities to network with like-minded professionals from around the world."  
  },
  {
    "acronym": "IROS",
    "fullname": "IEEE/RJS International Conference on Intelligent RObots and Systems",
    "area": "Interdisciplinary Areas",
    "subarea": "Robotics",
    "location": "Worldwide",
    "url":"http://iros.org/",
    "description":"Established since 1988, the IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) annually provides an international forum for world-wide robotics community to explore the frontier of science and technology in intelligent robots and smart machines, and to stimulate innovative ideas, exchange technological perspectives and assess future directions in the field of intelligent robots and smart machines with a view to promote progress and prosperity for all nations. In addition to technical sessions and multi-media presentations, IROS conferences also hold panel discussions, workshops, tutorials, exhibits and technical tours to enhance technical communications among the attendees."  
  },
  {
    "acronym": "RSS",
    "fullname": "Robotics: Science and Systems Conference",
    "area": "Interdisciplinary Areas",
    "subarea": "Robotics",
    "location": "Worldwide",
    "url":"https://roboticsconference.org/",
    "description":"The Robotics: Science and Systems has a long history of bringing together researchers in all areas of robotics from around the world for an engaging and focused week of single-track presentations, workshops, poster sessions, tutorials, and fun! This year, once again, we solicit your best work."  
  },
  {
    "acronym": "VIS",
    "fullname": "IEEE Transactions on Visualization and Computer Graphics",
    "area": "Interdisciplinary Areas",
    "subarea": "Visualization",
    "location": "Worldwide",
    "url":"http://ieeevis.org/",
    "description":"Not found"  
  },
  {
    "acronym": "VR",
    "fullname": "IEEE Conference on Virtual Reality and 3D User Interfaces",
    "area": "Interdisciplinary Areas",
    "subarea": "Visualization",
    "location": "Worldwide",
    "url":"http://ieeevr.org/",
    "description":"Since 1993, the IEEE Virtual Reality conference has been the premier international venue for the presentation of research results in the broad area of virtual reality (VR). Similarly, the IEEE Symposium on 3D User Interfaces (3DUI), which started as a workshop at IEEE VR in 2004, has become the premier venue for 3D user interfaces and 3D interaction in VR environments. As of 2018, VR and 3DUI have been merged into a single IEEE Conference on Virtual Reality and 3D User Interfaces, with the short name IEEE VR."  
  }
]
